package lab02

import kotlin.random.Random

//3. Створіть масив зі 100 елементів заповнений
// цілими числами від -100 до 100 (випадковим чином).

// Далі над цією колекцією проробіть послідовно такі дії
//·       Лишіть лише додатні числа з колекції
//·       Лишіть лише ті числа, що діляться на 5 без остачі.
//·       Кожне з отриманих чисел піднесіть до квадрату.
//·       Отриману колекцію відсортуйте за спаданням.
//·       Виведіть найбільше та найменше числа отриманої колекції.
//·       Перетворіть колекцію в колекцію рядків.
//·       З’єднайте отриману колекцію в один рядок через символ пропуску.

fun main() {
    val randomValues = List(100) {
        Random.nextInt(-100, 100)
    }
    println(randomValues)

    val res = randomValues
        .filter { it > 0 }
        .filter { it % 5 == 0 }
        .map { it * it }
        .sortedDescending()
        .map { it.toString() }
        .fold("") { acc, next ->
            "$acc $next"
        }
    println(res)

}